# DivisionGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..DivisionGeometry Property
GroupTypeId Class See Also
---
Division Geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId DivisionGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivisionGeometry As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DivisionGeometry {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace